app/controllers/cards_controller.rb

SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 348], ["LIMIT", 1]]
SELECT "cards".* FROM "cards" ORDER BY "cards"."id" DESC LIMIT ?  [["LIMIT", 1]]
INSERT INTO "cards" ("card_front", "card_back", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["card_front", "\\text{question1}"], ["card_back", "\\text{answer1}"], ["created_at", "2020-07-30 21:56:17.831228"], ["updated_at", "2020-07-30 21:56:17.831228"]]
INSERT INTO "course_cards" ("course_id", "card_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["course_id", 344], ["card_id", 763], ["created_at", "2020-07-30 21:56:17.842005"], ["updated_at", "2020-07-30 21:56:17.842005"]]
---
  def create
    courseId = dataParams[:course_id]
    cardsParam = dataParams[:cards]
    course = Course.find_by(id: courseId)

    cards = cardsParam.map do |card|
      myCard = course.cards.build(card)
      course.save

SELECT "cards".* FROM "cards" WHERE "cards"."id" = ? LIMIT ?  [["id", 784], ["LIMIT", 1]]
DELETE FROM "cards" WHERE "cards"."id" = ?  [["id", 784]]
---
  def destroy
    card = Card.find(params[:id])
    card.destroy