app/controllers/courses_controller.rb

  def create
    newUser = Course.create(courseParams)
---
INSERT INTO "courses" ("name", "private", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Math"], ["private", 0], ["user_id", 151], ["created_at", "2021-02-06 03:14:50.122436"], ["updated_at", "2021-02-06 03:14:50.122436"]]

  def destroy
    # byebug
    course = Course.find(params[:id])
    course.destroy
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 351], ["LIMIT", 1]]
DELETE FROM "courses" WHERE "courses"."id" = ?  [["id", 351]]