app/controllers/users_controller.rb

  def find_by_username
    user = User.find_by(username: params[:username])
---
SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "Ezra"], ["LIMIT", 1]]